[
  {
    "name":"The Smiths",
    "shortname":"The_Smiths",
    "bandLabel":"Rough Trade Records",
    "bio":"The Smiths were an English rock band formed in Manchester in 1982.  The band consisted of vocalist Morrissey, guitarist Johnny Marr, bassist Andy Rourke and drummer Mike Joyce.  Critics have called them the most important alternative rock band to emerge from the British independent music scene of the 1980s.  Q magazine's Simon Goddard argued in 2007 that the Smiths were \"the one truly vital voice of the '80s\", \"the most influential British guitar group of the decade\" and the \"first indie outsiders to achieve mainstream success on their own terms\".  The NME named the Smiths the \"most influential artist ever\" in a 2002 poll."
  },
  {
    "name":"The Runaways",
    "shortname":"The_Runaways",
    "bandLabel":"Mercury Records",
    "bio":"The Runaways were an American all-female rock band that recorded and performed in the second half of the 1970s. The band released four studio albums and one live set during its run. Among their best-known songs are \"Cherry Bomb\", \"Hollywood\", \"Queens of Noise\" and a cover version of the Velvet Underground’s \"Rock & Roll\". The Runaways, though never a major success in the United States, became a sensation overseas, e.g. in Japan, thanks to the hit single \"Cherry Bomb\"."
  },
  {
    "name":"The Pretty Reckless",
    "shortname":"The_Pretty_Reckless",
    "bandLabel":"Interscope Records",
    "bio":"The Pretty Reckless is an American rock band from New York City.  The current members are Taylor Momsen (lead vocals, rhythm guitar), Ben Phillips (lead guitar, backing vocals), Mark Damon (bass) and Jamie Perkins (drums).  The band was formed in 2009 and released their first studio album, Light Me Up, on August 31, 2010.  The album spawned three moderately successful singles, most notably, \"Make Me Wanna Die\"."
  },
  {
    "name":"Modest Mouse",
    "shortname":"Modest_Mouse",
    "bandLabel":"Sub Pop",
    "bio":"Modest Mouse is an American rock band formed in 1992 in Issaquah, Washington (a suburb of Seattle) and currently based in Portland, Oregon. The founding members of this group are lead singer/guitarist Isaac Brock, drummer Jeremiah Green, and bassist Eric Judy. Strongly influenced by groups such as Pavement, the Pixies, XTC, and Talking Heads, the band rehearsed, rearranged, and recorded demos for almost two years before finally signing with small-town indie label, K Records, and releasing numerous singles."
  },
  {
    "name":"The Killers",
    "shortname":"The_Killers",
    "bandLabel":"Island Records",
    "bio":"The Killers are an American rock band formed in Las Vegas, Nevada in 2001, by Brandon Flowers (lead vocals, keyboards) and Dave Keuning (guitar, backing vocals).  Mark Stoermer (bass guitar, backing vocals) and Ronnie Vannucci Jr. (drums, percussion) would complete the current line-up of the band in 2002.  The name The Killers is derived from a logo on the bass drum of a fictitious band, portrayed in the music video for the New Order song \"Crystal\"."
  },
  {
    "name":"The Red Hot Chili Peppers",
    "shortname":"Red_Hot_Chili_Peppers",
    "bandLabel":"Warner Bros. Records",
    "bio":"Red Hot Chili Peppers, also sometimes shortened to \"The Chili Peppers\" or abbreviated as \"RHCP\", are an American funk rock band formed in Los Angeles in 1983.  The group's musical style primarily consists of rock with an emphasis on funk, as well as elements from other genres such as punk rock and psychedelic rock.  When played live, their music incorporates elements of jam band due to the improvised nature of much of their performances.  Currently, the band consists of founding members Anthony Kiedis (vocals) and Flea (bass), longtime drummer Chad Smith; and guitarist Josh Klinghoffer, who joined in late-2009, replacing John Frusciante."
  },
  {
    "name":"Joan Jett and the Blackhearts",
    "shortname":"Joan_Jett_And_The_Blackhearts",
    "bandLabel":"Blackheart Records",
    "bio":"Joan Marie Larkin (born September 22, 1958) known professionally as Joan Jett, is an American rock singer, songwriter, composer, musician, record producer and occasional actress. She is best known for her work with Joan Jett & the Blackhearts, preceded by success with the Runaways, including their hit song \"Cherry Bomb\"."
  },
  {
    "name":"Panic at the Disco",
    "shortname":"Panic_At_The_Disco",
    "bandLabel":"Fueled by Ramen",
    "bio":"Panic! at the Disco is an American rock band from Las Vegas, Nevada, formed in 2004 and featuring the current lineup of vocalist Brendon Urie, accompanied on tour by bassist Dallon Weekes, guitarist Kenneth Harris and drummer Dan Pawlovich."
  },
  {
    "name":"Blink-182",
    "shortname":"Blink-182",
    "bandLabel":"Geffen Records",
    "bio":"Blink-182 (often stylized as blink-182) is an American rock band formed in Poway, California in 1992. The band currently consists of bassist and vocalist Mark Hoppus, drummer Travis Barker, and guitarist and vocalist Matt Skiba. Founded by Hoppus, guitarist and vocalist Tom DeLonge, and drummer Scott Raynor, the band emerged from the Southern California punk scene of the early 1990s and first gained notoriety for high-energy live shows and irreverent lyrical toilet humor."
  }
]